# 문자열에서 문자를 교환할 때 사용 할 딕셔너리 모듈

trans_dic = {
'[': '' ,
']': '',
'{' : '',
'}': '' ,
"'": '',
',' : '\n',
':' : '\n',
' ' : '',
'\n' : '\n·',
'-중식/석식-' : '\n[중식/석식]',
'-조식-' : '\n[조식]',
'-컵밥-' : '\n[컵밥]',
'-중식-' : '\n[중식]',
'-석식-' : '\n[석식]',
'-한식-' : '\n[한식]',
'-덮밥-' : '\n[덮밥]',
'-양식-' : '\n[양식]',
'-도시락-' : '\n[도시락]',
'-스페셜메뉴-' : '\n[스페셜메뉴]',
'-돈까스-' : '\n[돈까스]',
'-라면-' : '\n[라면]',
'-메뉴-' : '\n[메뉴]',
'-부대라면-' : '\n[부대라면]',
'-한정메뉴-' : '\n[한정메뉴]',
'-샐러드바-' : '\n[샐러드바]',
'\n·\n' : '\n\n',
'·' : '· ',
'-' : ' '
}

# 데이터를 보기 좋게 출력하기 위한 문자열 처리 함수
def char_replace(meal) :

	for key, value in trans_dic.items() :

		meal = meal.replace(key, value)

	return meal
