# 선택한 버튼이 학식 메뉴일 경우 메세지 포매팅
select_button = '[*] 선택한 버튼 : {0}\n[*] {1}의\n[*] {0} 메뉴입니다.\n'

# 선택한 버튼이 학식이 아닐 경우
select_else_button = '[*] 선택한 버튼 : {0}\n'

# 종강 버튼 선택 시
end_day = '[*] 오늘 : {0}\n[*] 종강 : {1}\n[*] 종강까지 {2}일 남았습니다.'

# json 파일 오픈 예외 문자
json_open_error = '\n에러메세지가 보이면 관리자에게 알려주세요.'

# 일요일 예외
sun_except = '\n일요일에 {0} 식당은\n운영하지 않습니다.'

# 주말 예외
weekend_except = '\n주말에 {0} 식당은\n운영하지 않습니다.'

# Wi-Fi 정보
wifi_info = '[*] ID : H(대문자)+학번(8자리)\n[*] 비밀번호 : 생년월일\n[*] 예시 : H20171234\n[*] 예시 : 980101'

# 심각한 오류
fatal_error = '[*] 심각한 오류입니다.\n[*] 개발자에게 알려주세요'
